name: "0-dpu-3"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 32
    mean_value: 128.0
    mean_value: 128.0
    mean_value: 128.0
  }
  data_param {
    source: "/home/zhangniansong/caffe_dev/examples/resnet-cifar10/cifar-10-batches-py/train"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "0-dpu-0_conv_1"
  type: "Convolution"
  bottom: "data"
  top: "conv_blob1"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_2"
  type: "Convolution"
  bottom: "conv_blob1"
  top: "conv_blob2"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_3"
  type: "Convolution"
  bottom: "conv_blob2"
  top: "conv_blob3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_1"
  type: "BatchNorm"
  bottom: "conv_blob3"
  top: "batch_norm_blob1"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_1"
  type: "Scale"
  bottom: "batch_norm_blob1"
  top: "batch_norm_blob1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_1"
  type: "ReLU"
  bottom: "batch_norm_blob1"
  top: "relu_blob1"
}
layer {
  name: "0-dpu-0_conv_4"
  type: "Convolution"
  bottom: "relu_blob1"
  top: "conv_blob4"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_2"
  type: "BatchNorm"
  bottom: "conv_blob4"
  top: "batch_norm_blob2"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_2"
  type: "Scale"
  bottom: "batch_norm_blob2"
  top: "batch_norm_blob2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_2"
  type: "ReLU"
  bottom: "batch_norm_blob2"
  top: "relu_blob2"
}
layer {
  name: "0-dpu-0_conv_5"
  type: "Convolution"
  bottom: "relu_blob2"
  top: "conv_blob5"
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_3"
  type: "BatchNorm"
  bottom: "conv_blob5"
  top: "batch_norm_blob3"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_3"
  type: "Scale"
  bottom: "batch_norm_blob3"
  top: "batch_norm_blob3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_6"
  type: "Convolution"
  bottom: "batch_norm_blob3"
  top: "conv_blob6"
  convolution_param {
    num_output: 24
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_7"
  type: "Convolution"
  bottom: "conv_blob6"
  top: "conv_blob7"
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_4"
  type: "BatchNorm"
  bottom: "conv_blob7"
  top: "batch_norm_blob4"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_4"
  type: "Scale"
  bottom: "batch_norm_blob4"
  top: "batch_norm_blob4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_3"
  type: "ReLU"
  bottom: "batch_norm_blob4"
  top: "relu_blob3"
}
layer {
  name: "0-dpu-0_conv_8"
  type: "Convolution"
  bottom: "relu_blob3"
  top: "conv_blob8"
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_5"
  type: "BatchNorm"
  bottom: "conv_blob8"
  top: "batch_norm_blob5"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_5"
  type: "Scale"
  bottom: "batch_norm_blob5"
  top: "batch_norm_blob5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_4"
  type: "ReLU"
  bottom: "batch_norm_blob5"
  top: "relu_blob4"
}
layer {
  name: "0-dpu-0_conv_9"
  type: "Convolution"
  bottom: "relu_blob4"
  top: "conv_blob9"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_6"
  type: "BatchNorm"
  bottom: "conv_blob9"
  top: "batch_norm_blob6"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_6"
  type: "Scale"
  bottom: "batch_norm_blob6"
  top: "batch_norm_blob6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_10"
  type: "Convolution"
  bottom: "batch_norm_blob6"
  top: "conv_blob10"
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_11"
  type: "Convolution"
  bottom: "conv_blob10"
  top: "conv_blob11"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_7"
  type: "BatchNorm"
  bottom: "conv_blob11"
  top: "batch_norm_blob7"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_7"
  type: "Scale"
  bottom: "batch_norm_blob7"
  top: "batch_norm_blob7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_1"
  type: "Scale"
  bottom: "batch_norm_blob7"
  top: "add_blob1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_5"
  type: "ReLU"
  bottom: "add_blob1"
  top: "relu_blob5"
}
layer {
  name: "0-dpu-0_mul_1"
  type: "Eltwise"
  bottom: "batch_norm_blob7"
  bottom: "relu_blob5"
  top: "mul_blob1"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_2"
  type: "Scale"
  bottom: "mul_blob1"
  top: "mul_blob2"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_12"
  type: "Convolution"
  bottom: "mul_blob2"
  top: "conv_blob12"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_8"
  type: "BatchNorm"
  bottom: "conv_blob12"
  top: "batch_norm_blob8"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_8"
  type: "Scale"
  bottom: "batch_norm_blob8"
  top: "batch_norm_blob8"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_2"
  type: "Scale"
  bottom: "batch_norm_blob8"
  top: "add_blob2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_6"
  type: "ReLU"
  bottom: "add_blob2"
  top: "relu_blob6"
}
layer {
  name: "0-dpu-0_mul_3"
  type: "Eltwise"
  bottom: "batch_norm_blob8"
  bottom: "relu_blob6"
  top: "mul_blob3"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_4"
  type: "Scale"
  bottom: "mul_blob3"
  top: "mul_blob4"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_13"
  type: "Convolution"
  bottom: "mul_blob4"
  top: "conv_blob13"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_9"
  type: "BatchNorm"
  bottom: "conv_blob13"
  top: "batch_norm_blob9"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_9"
  type: "Scale"
  bottom: "batch_norm_blob9"
  top: "batch_norm_blob9"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_14"
  type: "Convolution"
  bottom: "batch_norm_blob9"
  top: "conv_blob14"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_15"
  type: "Convolution"
  bottom: "conv_blob14"
  top: "conv_blob15"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_10"
  type: "BatchNorm"
  bottom: "conv_blob15"
  top: "batch_norm_blob10"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_10"
  type: "Scale"
  bottom: "batch_norm_blob10"
  top: "batch_norm_blob10"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_3"
  type: "Scale"
  bottom: "batch_norm_blob10"
  top: "add_blob3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_7"
  type: "ReLU"
  bottom: "add_blob3"
  top: "relu_blob7"
}
layer {
  name: "0-dpu-0_mul_5"
  type: "Eltwise"
  bottom: "batch_norm_blob10"
  bottom: "relu_blob7"
  top: "mul_blob5"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_6"
  type: "Scale"
  bottom: "mul_blob5"
  top: "mul_blob6"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_16"
  type: "Convolution"
  bottom: "mul_blob6"
  top: "conv_blob16"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 3
    kernel_size: 7
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_11"
  type: "BatchNorm"
  bottom: "conv_blob16"
  top: "batch_norm_blob11"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_11"
  type: "Scale"
  bottom: "batch_norm_blob11"
  top: "batch_norm_blob11"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_4"
  type: "Scale"
  bottom: "batch_norm_blob11"
  top: "add_blob4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_8"
  type: "ReLU"
  bottom: "add_blob4"
  top: "relu_blob8"
}
layer {
  name: "0-dpu-0_mul_7"
  type: "Eltwise"
  bottom: "batch_norm_blob11"
  bottom: "relu_blob8"
  top: "mul_blob7"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_8"
  type: "Scale"
  bottom: "mul_blob7"
  top: "mul_blob8"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_17"
  type: "Convolution"
  bottom: "mul_blob8"
  top: "conv_blob17"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_12"
  type: "BatchNorm"
  bottom: "conv_blob17"
  top: "batch_norm_blob12"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_12"
  type: "Scale"
  bottom: "batch_norm_blob12"
  top: "batch_norm_blob12"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_18"
  type: "Convolution"
  bottom: "batch_norm_blob12"
  top: "conv_blob18"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_19"
  type: "Convolution"
  bottom: "conv_blob18"
  top: "conv_blob19"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_13"
  type: "BatchNorm"
  bottom: "conv_blob19"
  top: "batch_norm_blob13"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_13"
  type: "Scale"
  bottom: "batch_norm_blob13"
  top: "batch_norm_blob13"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_5"
  type: "Scale"
  bottom: "batch_norm_blob13"
  top: "add_blob5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_9"
  type: "ReLU"
  bottom: "add_blob5"
  top: "relu_blob9"
}
layer {
  name: "0-dpu-0_mul_9"
  type: "Eltwise"
  bottom: "batch_norm_blob13"
  bottom: "relu_blob9"
  top: "mul_blob9"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_10"
  type: "Scale"
  bottom: "mul_blob9"
  top: "mul_blob10"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_20"
  type: "Convolution"
  bottom: "mul_blob10"
  top: "conv_blob20"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 2
    kernel_size: 5
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_14"
  type: "BatchNorm"
  bottom: "conv_blob20"
  top: "batch_norm_blob14"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_14"
  type: "Scale"
  bottom: "batch_norm_blob14"
  top: "batch_norm_blob14"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_6"
  type: "Scale"
  bottom: "batch_norm_blob14"
  top: "add_blob6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_10"
  type: "ReLU"
  bottom: "add_blob6"
  top: "relu_blob10"
}
layer {
  name: "0-dpu-0_mul_11"
  type: "Eltwise"
  bottom: "batch_norm_blob14"
  bottom: "relu_blob10"
  top: "mul_blob11"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_12"
  type: "Scale"
  bottom: "mul_blob11"
  top: "mul_blob12"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_21"
  type: "Convolution"
  bottom: "mul_blob12"
  top: "conv_blob21"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_15"
  type: "BatchNorm"
  bottom: "conv_blob21"
  top: "batch_norm_blob15"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_15"
  type: "Scale"
  bottom: "batch_norm_blob15"
  top: "batch_norm_blob15"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_22"
  type: "Convolution"
  bottom: "batch_norm_blob15"
  top: "conv_blob22"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_23"
  type: "Convolution"
  bottom: "conv_blob22"
  top: "conv_blob23"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_16"
  type: "BatchNorm"
  bottom: "conv_blob23"
  top: "batch_norm_blob16"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_16"
  type: "Scale"
  bottom: "batch_norm_blob16"
  top: "batch_norm_blob16"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_7"
  type: "Scale"
  bottom: "batch_norm_blob16"
  top: "add_blob7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_11"
  type: "ReLU"
  bottom: "add_blob7"
  top: "relu_blob11"
}
layer {
  name: "0-dpu-0_mul_13"
  type: "Eltwise"
  bottom: "batch_norm_blob16"
  bottom: "relu_blob11"
  top: "mul_blob13"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_14"
  type: "Scale"
  bottom: "mul_blob13"
  top: "mul_blob14"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_24"
  type: "Convolution"
  bottom: "mul_blob14"
  top: "conv_blob24"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_17"
  type: "BatchNorm"
  bottom: "conv_blob24"
  top: "batch_norm_blob17"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_17"
  type: "Scale"
  bottom: "batch_norm_blob17"
  top: "batch_norm_blob17"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_8"
  type: "Scale"
  bottom: "batch_norm_blob17"
  top: "add_blob8"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_12"
  type: "ReLU"
  bottom: "add_blob8"
  top: "relu_blob12"
}
layer {
  name: "0-dpu-0_mul_15"
  type: "Eltwise"
  bottom: "batch_norm_blob17"
  bottom: "relu_blob12"
  top: "mul_blob15"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_16"
  type: "Scale"
  bottom: "mul_blob15"
  top: "mul_blob16"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_25"
  type: "Convolution"
  bottom: "mul_blob16"
  top: "conv_blob25"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_18"
  type: "BatchNorm"
  bottom: "conv_blob25"
  top: "batch_norm_blob18"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_18"
  type: "Scale"
  bottom: "batch_norm_blob18"
  top: "batch_norm_blob18"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_26"
  type: "Convolution"
  bottom: "batch_norm_blob18"
  top: "conv_blob26"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_27"
  type: "Convolution"
  bottom: "conv_blob26"
  top: "conv_blob27"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_19"
  type: "BatchNorm"
  bottom: "conv_blob27"
  top: "batch_norm_blob19"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_19"
  type: "Scale"
  bottom: "batch_norm_blob19"
  top: "batch_norm_blob19"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_9"
  type: "Scale"
  bottom: "batch_norm_blob19"
  top: "add_blob9"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_13"
  type: "ReLU"
  bottom: "add_blob9"
  top: "relu_blob13"
}
layer {
  name: "0-dpu-0_mul_17"
  type: "Eltwise"
  bottom: "batch_norm_blob19"
  bottom: "relu_blob13"
  top: "mul_blob17"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_18"
  type: "Scale"
  bottom: "mul_blob17"
  top: "mul_blob18"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_28"
  type: "Convolution"
  bottom: "mul_blob18"
  top: "conv_blob28"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 3
    kernel_size: 7
    group: 256
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_20"
  type: "BatchNorm"
  bottom: "conv_blob28"
  top: "batch_norm_blob20"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_20"
  type: "Scale"
  bottom: "batch_norm_blob20"
  top: "batch_norm_blob20"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_10"
  type: "Scale"
  bottom: "batch_norm_blob20"
  top: "add_blob10"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_14"
  type: "ReLU"
  bottom: "add_blob10"
  top: "relu_blob14"
}
layer {
  name: "0-dpu-0_mul_19"
  type: "Eltwise"
  bottom: "batch_norm_blob20"
  bottom: "relu_blob14"
  top: "mul_blob19"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_20"
  type: "Scale"
  bottom: "mul_blob19"
  top: "mul_blob20"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_29"
  type: "Convolution"
  bottom: "mul_blob20"
  top: "conv_blob29"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_21"
  type: "BatchNorm"
  bottom: "conv_blob29"
  top: "batch_norm_blob21"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_21"
  type: "Scale"
  bottom: "batch_norm_blob21"
  top: "batch_norm_blob21"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_30"
  type: "Convolution"
  bottom: "batch_norm_blob21"
  top: "conv_blob30"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_31"
  type: "Convolution"
  bottom: "conv_blob30"
  top: "conv_blob31"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_22"
  type: "BatchNorm"
  bottom: "conv_blob31"
  top: "batch_norm_blob22"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_22"
  type: "Scale"
  bottom: "batch_norm_blob22"
  top: "batch_norm_blob22"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_11"
  type: "Scale"
  bottom: "batch_norm_blob22"
  top: "add_blob11"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_15"
  type: "ReLU"
  bottom: "add_blob11"
  top: "relu_blob15"
}
layer {
  name: "0-dpu-0_mul_21"
  type: "Eltwise"
  bottom: "batch_norm_blob22"
  bottom: "relu_blob15"
  top: "mul_blob21"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_22"
  type: "Scale"
  bottom: "mul_blob21"
  top: "mul_blob22"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_32"
  type: "Convolution"
  bottom: "mul_blob22"
  top: "conv_blob32"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_23"
  type: "BatchNorm"
  bottom: "conv_blob32"
  top: "batch_norm_blob23"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_23"
  type: "Scale"
  bottom: "batch_norm_blob23"
  top: "batch_norm_blob23"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_12"
  type: "Scale"
  bottom: "batch_norm_blob23"
  top: "add_blob12"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_16"
  type: "ReLU"
  bottom: "add_blob12"
  top: "relu_blob16"
}
layer {
  name: "0-dpu-0_mul_23"
  type: "Eltwise"
  bottom: "batch_norm_blob23"
  bottom: "relu_blob16"
  top: "mul_blob23"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_24"
  type: "Scale"
  bottom: "mul_blob23"
  top: "mul_blob24"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_33"
  type: "Convolution"
  bottom: "mul_blob24"
  top: "conv_blob33"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_24"
  type: "BatchNorm"
  bottom: "conv_blob33"
  top: "batch_norm_blob24"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_24"
  type: "Scale"
  bottom: "batch_norm_blob24"
  top: "batch_norm_blob24"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_34"
  type: "Convolution"
  bottom: "batch_norm_blob24"
  top: "conv_blob34"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_35"
  type: "Convolution"
  bottom: "conv_blob34"
  top: "conv_blob35"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_25"
  type: "BatchNorm"
  bottom: "conv_blob35"
  top: "batch_norm_blob25"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_25"
  type: "Scale"
  bottom: "batch_norm_blob25"
  top: "batch_norm_blob25"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_13"
  type: "Scale"
  bottom: "batch_norm_blob25"
  top: "add_blob13"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_17"
  type: "ReLU"
  bottom: "add_blob13"
  top: "relu_blob17"
}
layer {
  name: "0-dpu-0_mul_25"
  type: "Eltwise"
  bottom: "batch_norm_blob25"
  bottom: "relu_blob17"
  top: "mul_blob25"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_26"
  type: "Scale"
  bottom: "mul_blob25"
  top: "mul_blob26"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_36"
  type: "Convolution"
  bottom: "mul_blob26"
  top: "conv_blob36"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 2
    kernel_size: 5
    group: 128
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_26"
  type: "BatchNorm"
  bottom: "conv_blob36"
  top: "batch_norm_blob26"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_26"
  type: "Scale"
  bottom: "batch_norm_blob26"
  top: "batch_norm_blob26"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_14"
  type: "Scale"
  bottom: "batch_norm_blob26"
  top: "add_blob14"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_18"
  type: "ReLU"
  bottom: "add_blob14"
  top: "relu_blob18"
}
layer {
  name: "0-dpu-0_mul_27"
  type: "Eltwise"
  bottom: "batch_norm_blob26"
  bottom: "relu_blob18"
  top: "mul_blob27"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_28"
  type: "Scale"
  bottom: "mul_blob27"
  top: "mul_blob28"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_37"
  type: "Convolution"
  bottom: "mul_blob28"
  top: "conv_blob37"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_27"
  type: "BatchNorm"
  bottom: "conv_blob37"
  top: "batch_norm_blob27"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_27"
  type: "Scale"
  bottom: "batch_norm_blob27"
  top: "batch_norm_blob27"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_38"
  type: "Convolution"
  bottom: "batch_norm_blob27"
  top: "conv_blob38"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_39"
  type: "Convolution"
  bottom: "conv_blob38"
  top: "conv_blob39"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_28"
  type: "BatchNorm"
  bottom: "conv_blob39"
  top: "batch_norm_blob28"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_28"
  type: "Scale"
  bottom: "batch_norm_blob28"
  top: "batch_norm_blob28"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_15"
  type: "Scale"
  bottom: "batch_norm_blob28"
  top: "add_blob15"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_19"
  type: "ReLU"
  bottom: "add_blob15"
  top: "relu_blob19"
}
layer {
  name: "0-dpu-0_mul_29"
  type: "Eltwise"
  bottom: "batch_norm_blob28"
  bottom: "relu_blob19"
  top: "mul_blob29"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_30"
  type: "Scale"
  bottom: "mul_blob29"
  top: "mul_blob30"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_40"
  type: "Convolution"
  bottom: "mul_blob30"
  top: "conv_blob40"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 3
    kernel_size: 7
    group: 128
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_29"
  type: "BatchNorm"
  bottom: "conv_blob40"
  top: "batch_norm_blob29"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_29"
  type: "Scale"
  bottom: "batch_norm_blob29"
  top: "batch_norm_blob29"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_16"
  type: "Scale"
  bottom: "batch_norm_blob29"
  top: "add_blob16"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_20"
  type: "ReLU"
  bottom: "add_blob16"
  top: "relu_blob20"
}
layer {
  name: "0-dpu-0_mul_31"
  type: "Eltwise"
  bottom: "batch_norm_blob29"
  bottom: "relu_blob20"
  top: "mul_blob31"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_32"
  type: "Scale"
  bottom: "mul_blob31"
  top: "mul_blob32"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_41"
  type: "Convolution"
  bottom: "mul_blob32"
  top: "conv_blob41"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_30"
  type: "BatchNorm"
  bottom: "conv_blob41"
  top: "batch_norm_blob30"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_30"
  type: "Scale"
  bottom: "batch_norm_blob30"
  top: "batch_norm_blob30"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_42"
  type: "Convolution"
  bottom: "batch_norm_blob30"
  top: "conv_blob42"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_43"
  type: "Convolution"
  bottom: "conv_blob42"
  top: "conv_blob43"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_31"
  type: "BatchNorm"
  bottom: "conv_blob43"
  top: "batch_norm_blob31"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_31"
  type: "Scale"
  bottom: "batch_norm_blob31"
  top: "batch_norm_blob31"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_17"
  type: "Scale"
  bottom: "batch_norm_blob31"
  top: "add_blob17"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_21"
  type: "ReLU"
  bottom: "add_blob17"
  top: "relu_blob21"
}
layer {
  name: "0-dpu-0_mul_33"
  type: "Eltwise"
  bottom: "batch_norm_blob31"
  bottom: "relu_blob21"
  top: "mul_blob33"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_34"
  type: "Scale"
  bottom: "mul_blob33"
  top: "mul_blob34"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_44"
  type: "Convolution"
  bottom: "mul_blob34"
  top: "conv_blob44"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_32"
  type: "BatchNorm"
  bottom: "conv_blob44"
  top: "batch_norm_blob32"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_32"
  type: "Scale"
  bottom: "batch_norm_blob32"
  top: "batch_norm_blob32"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_18"
  type: "Scale"
  bottom: "batch_norm_blob32"
  top: "add_blob18"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_22"
  type: "ReLU"
  bottom: "add_blob18"
  top: "relu_blob22"
}
layer {
  name: "0-dpu-0_mul_35"
  type: "Eltwise"
  bottom: "batch_norm_blob32"
  bottom: "relu_blob22"
  top: "mul_blob35"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_36"
  type: "Scale"
  bottom: "mul_blob35"
  top: "mul_blob36"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_45"
  type: "Convolution"
  bottom: "mul_blob36"
  top: "conv_blob45"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_33"
  type: "BatchNorm"
  bottom: "conv_blob45"
  top: "batch_norm_blob33"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_33"
  type: "Scale"
  bottom: "batch_norm_blob33"
  top: "batch_norm_blob33"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_46"
  type: "Convolution"
  bottom: "batch_norm_blob33"
  top: "conv_blob46"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_47"
  type: "Convolution"
  bottom: "conv_blob46"
  top: "conv_blob47"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_34"
  type: "BatchNorm"
  bottom: "conv_blob47"
  top: "batch_norm_blob34"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_34"
  type: "Scale"
  bottom: "batch_norm_blob34"
  top: "batch_norm_blob34"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_19"
  type: "Scale"
  bottom: "batch_norm_blob34"
  top: "add_blob19"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_23"
  type: "ReLU"
  bottom: "add_blob19"
  top: "relu_blob23"
}
layer {
  name: "0-dpu-0_mul_37"
  type: "Eltwise"
  bottom: "batch_norm_blob34"
  bottom: "relu_blob23"
  top: "mul_blob37"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_38"
  type: "Scale"
  bottom: "mul_blob37"
  top: "mul_blob38"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_48"
  type: "Convolution"
  bottom: "mul_blob38"
  top: "conv_blob48"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 2
    kernel_size: 5
    group: 256
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_35"
  type: "BatchNorm"
  bottom: "conv_blob48"
  top: "batch_norm_blob35"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_35"
  type: "Scale"
  bottom: "batch_norm_blob35"
  top: "batch_norm_blob35"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_20"
  type: "Scale"
  bottom: "batch_norm_blob35"
  top: "add_blob20"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_24"
  type: "ReLU"
  bottom: "add_blob20"
  top: "relu_blob24"
}
layer {
  name: "0-dpu-0_mul_39"
  type: "Eltwise"
  bottom: "batch_norm_blob35"
  bottom: "relu_blob24"
  top: "mul_blob39"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_40"
  type: "Scale"
  bottom: "mul_blob39"
  top: "mul_blob40"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_49"
  type: "Convolution"
  bottom: "mul_blob40"
  top: "conv_blob49"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_36"
  type: "BatchNorm"
  bottom: "conv_blob49"
  top: "batch_norm_blob36"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_36"
  type: "Scale"
  bottom: "batch_norm_blob36"
  top: "batch_norm_blob36"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_conv_50"
  type: "Convolution"
  bottom: "batch_norm_blob36"
  top: "conv_blob50"
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_51"
  type: "Convolution"
  bottom: "conv_blob50"
  top: "conv_blob51"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_37"
  type: "BatchNorm"
  bottom: "conv_blob51"
  top: "batch_norm_blob37"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_37"
  type: "Scale"
  bottom: "batch_norm_blob37"
  top: "batch_norm_blob37"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_21"
  type: "Scale"
  bottom: "batch_norm_blob37"
  top: "add_blob21"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_25"
  type: "ReLU"
  bottom: "add_blob21"
  top: "relu_blob25"
}
layer {
  name: "0-dpu-0_mul_41"
  type: "Eltwise"
  bottom: "batch_norm_blob37"
  bottom: "relu_blob25"
  top: "mul_blob41"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_42"
  type: "Scale"
  bottom: "mul_blob41"
  top: "mul_blob42"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_52"
  type: "Convolution"
  bottom: "mul_blob42"
  top: "conv_blob52"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_38"
  type: "BatchNorm"
  bottom: "conv_blob52"
  top: "batch_norm_blob38"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_38"
  type: "Scale"
  bottom: "batch_norm_blob38"
  top: "batch_norm_blob38"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_22"
  type: "Scale"
  bottom: "batch_norm_blob38"
  top: "add_blob22"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_26"
  type: "ReLU"
  bottom: "add_blob22"
  top: "relu_blob26"
}
layer {
  name: "0-dpu-0_mul_43"
  type: "Eltwise"
  bottom: "batch_norm_blob38"
  bottom: "relu_blob26"
  top: "mul_blob43"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_44"
  type: "Scale"
  bottom: "mul_blob43"
  top: "mul_blob44"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_53"
  type: "Convolution"
  bottom: "mul_blob44"
  top: "conv_blob53"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_39"
  type: "BatchNorm"
  bottom: "conv_blob53"
  top: "batch_norm_blob39"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_39"
  type: "Scale"
  bottom: "batch_norm_blob39"
  top: "batch_norm_blob39"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_23"
  type: "Eltwise"
  bottom: "batch_norm_blob39"
  bottom: "conv_blob50"
  top: "add_blob23"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "0-dpu-0_conv_54"
  type: "Convolution"
  bottom: "add_blob23"
  top: "conv_blob54"
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_55"
  type: "Convolution"
  bottom: "conv_blob54"
  top: "conv_blob55"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_40"
  type: "BatchNorm"
  bottom: "conv_blob55"
  top: "batch_norm_blob40"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_40"
  type: "Scale"
  bottom: "batch_norm_blob40"
  top: "batch_norm_blob40"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_24"
  type: "Scale"
  bottom: "batch_norm_blob40"
  top: "add_blob24"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_27"
  type: "ReLU"
  bottom: "add_blob24"
  top: "relu_blob27"
}
layer {
  name: "0-dpu-0_mul_45"
  type: "Eltwise"
  bottom: "batch_norm_blob40"
  bottom: "relu_blob27"
  top: "mul_blob45"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_46"
  type: "Scale"
  bottom: "mul_blob45"
  top: "mul_blob46"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_56"
  type: "Convolution"
  bottom: "mul_blob46"
  top: "conv_blob56"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 2
    kernel_size: 5
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_41"
  type: "BatchNorm"
  bottom: "conv_blob56"
  top: "batch_norm_blob41"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_41"
  type: "Scale"
  bottom: "batch_norm_blob41"
  top: "batch_norm_blob41"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_25"
  type: "Scale"
  bottom: "batch_norm_blob41"
  top: "add_blob25"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_28"
  type: "ReLU"
  bottom: "add_blob25"
  top: "relu_blob28"
}
layer {
  name: "0-dpu-0_mul_47"
  type: "Eltwise"
  bottom: "batch_norm_blob41"
  bottom: "relu_blob28"
  top: "mul_blob47"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_48"
  type: "Scale"
  bottom: "mul_blob47"
  top: "mul_blob48"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_57"
  type: "Convolution"
  bottom: "mul_blob48"
  top: "conv_blob57"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_42"
  type: "BatchNorm"
  bottom: "conv_blob57"
  top: "batch_norm_blob42"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_42"
  type: "Scale"
  bottom: "batch_norm_blob42"
  top: "batch_norm_blob42"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_26"
  type: "Eltwise"
  bottom: "batch_norm_blob42"
  bottom: "conv_blob54"
  top: "add_blob26"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "0-dpu-0_conv_58"
  type: "Convolution"
  bottom: "add_blob26"
  top: "conv_blob58"
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_59"
  type: "Convolution"
  bottom: "conv_blob58"
  top: "conv_blob59"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_43"
  type: "BatchNorm"
  bottom: "conv_blob59"
  top: "batch_norm_blob43"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_43"
  type: "Scale"
  bottom: "batch_norm_blob43"
  top: "batch_norm_blob43"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_27"
  type: "Scale"
  bottom: "batch_norm_blob43"
  top: "add_blob27"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_29"
  type: "ReLU"
  bottom: "add_blob27"
  top: "relu_blob29"
}
layer {
  name: "0-dpu-0_mul_49"
  type: "Eltwise"
  bottom: "batch_norm_blob43"
  bottom: "relu_blob29"
  top: "mul_blob49"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_50"
  type: "Scale"
  bottom: "mul_blob49"
  top: "mul_blob50"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_60"
  type: "Convolution"
  bottom: "mul_blob50"
  top: "conv_blob60"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 3
    kernel_size: 7
    group: 192
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_44"
  type: "BatchNorm"
  bottom: "conv_blob60"
  top: "batch_norm_blob44"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_44"
  type: "Scale"
  bottom: "batch_norm_blob44"
  top: "batch_norm_blob44"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_28"
  type: "Scale"
  bottom: "batch_norm_blob44"
  top: "add_blob28"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_30"
  type: "ReLU"
  bottom: "add_blob28"
  top: "relu_blob30"
}
layer {
  name: "0-dpu-0_mul_51"
  type: "Eltwise"
  bottom: "batch_norm_blob44"
  bottom: "relu_blob30"
  top: "mul_blob51"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_52"
  type: "Scale"
  bottom: "mul_blob51"
  top: "mul_blob52"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_61"
  type: "Convolution"
  bottom: "mul_blob52"
  top: "conv_blob61"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_45"
  type: "BatchNorm"
  bottom: "conv_blob61"
  top: "batch_norm_blob45"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_45"
  type: "Scale"
  bottom: "batch_norm_blob45"
  top: "batch_norm_blob45"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_29"
  type: "Eltwise"
  bottom: "batch_norm_blob45"
  bottom: "conv_blob58"
  top: "add_blob29"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "0-dpu-0_conv_62"
  type: "Convolution"
  bottom: "add_blob29"
  top: "conv_blob62"
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_conv_63"
  type: "Convolution"
  bottom: "conv_blob62"
  top: "conv_blob63"
  convolution_param {
    num_output: 288
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_46"
  type: "BatchNorm"
  bottom: "conv_blob63"
  top: "batch_norm_blob46"
  batch_norm_param {
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "0-dpu-0_bn_scale_46"
  type: "Scale"
  bottom: "batch_norm_blob46"
  top: "batch_norm_blob46"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_add_30"
  type: "Scale"
  bottom: "batch_norm_blob46"
  top: "add_blob30"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "0-dpu-0_relu_31"
  type: "ReLU"
  bottom: "add_blob30"
  top: "relu_blob31"
}
layer {
  name: "0-dpu-0_mul_53"
  type: "Eltwise"
  bottom: "batch_norm_blob46"
  bottom: "relu_blob31"
  top: "mul_blob53"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "0-dpu-0_mul_54"
  type: "Scale"
  bottom: "mul_blob53"
  top: "mul_blob54"
  scale_param {
    bias_term: false
  }
}
layer {
  name: "0-dpu-0_conv_64"
  type: "Convolution"
  bottom: "mul_blob54"
  top: "conv_blob64"
  convolution_param {
    num_output: 288
    bias_term: false
    pad: 3
    kernel_size: 7
    group: 288
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "0-dpu-0_batch_norm_47"
  type: "BatchNorm"
  bottom: "conv_blob64"
